[
  {
    "title": "New tool to detect new physics at LHCb experiment 🤩!",
    "description": "A new algorithm at LHCb improves real-time reconstruction of displaced vertices using a Neural Network, increasing track efficiency and detecting long-lived particles.",
    "url": "https://arxiv.org/abs/2503.13092"
  },
  {
    "title": "New electronics for the HADES MDC drift chambers",
    "description": "HADES at GSI upgrades drift chamber electronics with PASTTREC ASICs and FPGA-based TDCs to handle higher trigger rates while addressing space, noise, and power constraints.",
    "url": "https://doi.org/10.1088/1748-0221/19/02/C02056"
  },
  {
    "title": "Impact of the high-level trigger for detecting long-lived particles at LHCb",
    "description": "LHCb adapts trigger algorithms to detect long-lived particles by improving efficiency in handling hit combinations, enhancing LLP reconstruction.",
    "url": "https://doi.org/10.1051/epjconf/202429502015"
  },
  {
    "title": "LHCb potential to discover long-lived new physics particles with lifetimes above 100 ps",
    "description": "LHCb, using the Downstream algorithm, could excel at detecting long-lived particles, rivaling dedicated LLP experiments.",
    "url": "https://doi.org/10.1140/epjc/s10052-024-12906-3"
  },
  {
    "title": "Low Gain Avalanche Detector Application for Beam Monitoring.",
    "description": "The S-DALINAC accelerator uses LGAD sensors to non-destructively monitor the beam's time structure during energy recovery mode.",
    "url": "https://doi.org/10.18429/JACoW-IBIC2022-MOP29"
  },
  {
    "title": "LGAD technology for HADES, accelerator and medical applications.",
    "description": "LGAD technology is used for high-precision beam detectors in applications like HADES, S-DALINAC, and MedAustron, with plans for future upgrades at GSI and FAIR.",
    "url": "https://doi.org/10.1016/j.nima.2022.167046"
  },
  {
    "title": "Pomeron/glueball and odderon/oddball trajectories",
    "description": "This study predicts glueball and oddball resonances along pomeron and odderon trajectories, using high-energy proton scattering data.",
    "url": "https://doi.org/10.1016/j.nuclphysa.2020.121728"
  }
]



